package com.jsmy.pingshan.bean;

import java.util.List;

/**
 * Created by Administrator on 2017/12/11.
 */

public class XZQBean {

    /**
     * check :
     * code : Y
     * data : {"list":[{"list2":[{"cid":"511529100001000","cmc":"东城社区"},{"cid":"511529100002000","cmc":"南城社区"},{"cid":"511529100003000","cmc":"西城社区"},{"cid":"511529100004000","cmc":"北城社区"},{"cid":"511529100201000","cmc":"共和村"},{"cid":"511529100202000","cmc":"金鱼村"},{"cid":"511529100203000","cmc":"平和村"},{"cid":"511529100204000","cmc":"永跃村"},{"cid":"511529100205000","cmc":"芋和村"},{"cid":"511529100206000","cmc":"集翠村"},{"cid":"511529100207000","cmc":"锦屏村"},{"cid":"511529100208000","cmc":"万涡村"},{"cid":"511529100209000","cmc":"桃坪村"},{"cid":"511529100210000","cmc":"附城村"},{"cid":"511529100211000","cmc":"回龙村"},{"cid":"511529100212000","cmc":"青年村"},{"cid":"511529100213000","cmc":"盐井村"},{"cid":"511529100214000","cmc":"五一村"},{"cid":"511529100215000","cmc":"六一五村"},{"cid":"511529100216000","cmc":"新村"},{"cid":"511529100217000","cmc":"光辉村"},{"cid":"511529100218000","cmc":"天仙村"},{"cid":"511529100219000","cmc":"四坪村"},{"cid":"511529100220000","cmc":"中和村"},{"cid":"511529100221000","cmc":"柏坪村"},{"cid":"511529100222000","cmc":"栗子村"},{"cid":"511529100223000","cmc":"金沙村"}],"zid":"511529100000000","zmc":"锦屏镇"},{"list2":[{"cid":"511529103001000","cmc":"汇龙社区"},{"cid":"511529103201000","cmc":"会河村"},{"cid":"511529103202000","cmc":"中心村"},{"cid":"511529103203000","cmc":"五桐村"},{"cid":"511529103204000","cmc":"旭光村"},{"cid":"511529103205000","cmc":"稻田村"},{"cid":"511529103206000","cmc":"银厂村"},{"cid":"511529103207000","cmc":"新农村"},{"cid":"511529103208000","cmc":"打鱼村"},{"cid":"511529103209000","cmc":"竹林村"},{"cid":"511529103210000","cmc":"大坳村"},{"cid":"511529103211000","cmc":"铜厂村"},{"cid":"511529103212000","cmc":"复兴村"},{"cid":"511529103213000","cmc":"炭石村"},{"cid":"511529103214000","cmc":"早稻村"},{"cid":"511529103215000","cmc":"劳动村"},{"cid":"511529103216000","cmc":"小龙村"},{"cid":"511529103217000","cmc":"中埂村"},{"cid":"511529103218000","cmc":"鱼孔村"}],"zid":"511529103000000","zmc":"龙华镇"},{"list2":[{"cid":"511529104001000","cmc":"和平社区"},{"cid":"511529104201000","cmc":"安子村"},{"cid":"511529104202000","cmc":"大田村"},{"cid":"511529104203000","cmc":"白合村"},{"cid":"511529104204000","cmc":"下坝村"},{"cid":"511529104205000","cmc":"和木村"},{"cid":"511529104206000","cmc":"龙胜村"},{"cid":"511529104207000","cmc":"马脑村"},{"cid":"511529104208000","cmc":"三合村"},{"cid":"511529104209000","cmc":"京坪村"},{"cid":"511529104210000","cmc":"柏杨村"},{"cid":"511529104211000","cmc":"杨柳村"},{"cid":"511529104212000","cmc":"正直村"},{"cid":"511529104213000","cmc":"中坪村"},{"cid":"511529104214000","cmc":"岩门村"},{"cid":"511529104215000","cmc":"公坪村"},{"cid":"511529104216000","cmc":"双峰村"},{"cid":"511529104217000","cmc":"新华村"},{"cid":"511529104218000","cmc":"沙坪村"},{"cid":"511529104219000","cmc":"全和村"}],"zid":"511529104000000","zmc":"大乘镇"},{"list2":[{"cid":"511529105001000","cmc":"福兴社区"},{"cid":"511529105201000","cmc":"辣子村"},{"cid":"511529105202000","cmc":"五星村"},{"cid":"511529105203000","cmc":"附场村"},{"cid":"511529105204000","cmc":"金江村"},{"cid":"511529105205000","cmc":"庙坝村"},{"cid":"511529105206000","cmc":"五峰村"},{"cid":"511529105207000","cmc":"新大村"},{"cid":"511529105208000","cmc":"新白村"},{"cid":"511529105209000","cmc":"尖山村"},{"cid":"511529105210000","cmc":"火焰村"},{"cid":"511529105211000","cmc":"旺乐村"},{"cid":"511529105212000","cmc":"桤木村"},{"cid":"511529105213000","cmc":"照宝村"},{"cid":"511529105214000","cmc":"松树村"},{"cid":"511529105215000","cmc":"中坝村"},{"cid":"511529105216000","cmc":"新庄村"},{"cid":"511529105217000","cmc":"碾米村"},{"cid":"511529105218000","cmc":"团结村"}],"zid":"511529105000000","zmc":"福延镇"},{"list2":[{"cid":"511529106201000","cmc":"园田村"},{"cid":"511529106202000","cmc":"楠木村"},{"cid":"511529106203000","cmc":"龙池村"},{"cid":"511529106204000","cmc":"撕粟村"},{"cid":"511529106205000","cmc":"茶叶村"},{"cid":"511529106206000","cmc":"白果村"},{"cid":"511529106207000","cmc":"青华村"},{"cid":"511529106208000","cmc":"蔡和村"},{"cid":"511529106209000","cmc":"漆树村"},{"cid":"511529106210000","cmc":"玉峰村"},{"cid":"511529106211000","cmc":"油坊村"},{"cid":"511529106212000","cmc":"三洞村"},{"cid":"511529106213000","cmc":"长田村"},{"cid":"511529106214000","cmc":"沙田村"},{"cid":"511529106215000","cmc":"柏香村"},{"cid":"511529106216000","cmc":"朝阳村"},{"cid":"511529106217000","cmc":"团田村"}],"zid":"511529106000000","zmc":"富荣镇"},{"list2":[{"cid":"511529107201000","cmc":"新江村"},{"cid":"511529107202000","cmc":"金星村"},{"cid":"511529107203000","cmc":"联合村"},{"cid":"511529107204000","cmc":"民主村"},{"cid":"511529107205000","cmc":"胜利村"},{"cid":"511529107206000","cmc":"新光村"},{"cid":"511529107207000","cmc":"金鸭村"},{"cid":"511529107208000","cmc":"红庙村"},{"cid":"511529107209000","cmc":"新民村"},{"cid":"511529107210000","cmc":"新春村"},{"cid":"511529107211000","cmc":"勤俭村"},{"cid":"511529107212000","cmc":"石龙村"},{"cid":"511529107213000","cmc":"大坪村"},{"cid":"511529107214000","cmc":"红丰村"},{"cid":"511529107215000","cmc":"解吉村"},{"cid":"511529107216000","cmc":"井坝村"},{"cid":"511529107217000","cmc":"石溪村"},{"cid":"511529107218000","cmc":"干河村"},{"cid":"511529107219000","cmc":"龙桥村"},{"cid":"511529107220000","cmc":"新开村"},{"cid":"511529107221000","cmc":"和平村"}],"zid":"511529107000000","zmc":"新安镇"},{"list2":[{"cid":"511529202001000","cmc":"场镇居委会"},{"cid":"511529202201000","cmc":"田坝村"},{"cid":"511529202202000","cmc":"宝宁村"},{"cid":"511529202203000","cmc":"沙坝村"},{"cid":"511529202204000","cmc":"月坡村"},{"cid":"511529202205000","cmc":"西村"},{"cid":"511529202206000","cmc":"书楼村"},{"cid":"511529202207000","cmc":"石岗村"},{"cid":"511529202208000","cmc":"桂花村"},{"cid":"511529202209000","cmc":"高田村"},{"cid":"511529202210000","cmc":"莲花村"},{"cid":"511529202211000","cmc":"芭蕉村"}],"zid":"511529202000000","zmc":"楼东乡"},{"list2":[{"cid":"511529203201000","cmc":"屏宜村"},{"cid":"511529203202000","cmc":"中华村"},{"cid":"511529203203000","cmc":"大坝村"},{"cid":"511529203204000","cmc":"周家山村"},{"cid":"511529203205000","cmc":"隆兴村"},{"cid":"511529203206000","cmc":"越红村"},{"cid":"511529203207000","cmc":"华象村"},{"cid":"511529203208000","cmc":"清平村"},{"cid":"511529203209000","cmc":"工农村"},{"cid":"511529203210000","cmc":"油花村"},{"cid":"511529203211000","cmc":"长乐村"},{"cid":"511529203212000","cmc":"民乐村"},{"cid":"511529203213000","cmc":"白坝村"},{"cid":"511529203214000","cmc":"光明村"},{"cid":"511529203215000","cmc":"保护村"},{"cid":"511529203216000","cmc":"染房村"}],"zid":"511529203000000","zmc":"鸭池乡"},{"list2":[{"cid":"511529204201000","cmc":"八一村"},{"cid":"511529204202000","cmc":"四合村"},{"cid":"511529204203000","cmc":"新胜村"},{"cid":"511529204204000","cmc":"人民村"},{"cid":"511529204205000","cmc":"改换村"},{"cid":"511529204206000","cmc":"翻身村"},{"cid":"511529204207000","cmc":"大兴村"},{"cid":"511529204208000","cmc":"幸福村"},{"cid":"511529204209000","cmc":"民和村"},{"cid":"511529204210000","cmc":"农民村"}],"zid":"511529204000000","zmc":"龙溪乡"},{"list2":[{"cid":"511529205201000","cmc":"春风村"},{"cid":"511529205202000","cmc":"龙堂村"},{"cid":"511529205203000","cmc":"龙山村"},{"cid":"511529205204000","cmc":"前哨村"},{"cid":"511529205205000","cmc":"宝山村"},{"cid":"511529205206000","cmc":"易子村"},{"cid":"511529205207000","cmc":"火星村"},{"cid":"511529205208000","cmc":"通林村"},{"cid":"511529205209000","cmc":"小坪村"},{"cid":"511529205210000","cmc":"丰收村"},{"cid":"511529205211000","cmc":"大池村"},{"cid":"511529205212000","cmc":"中和村"},{"cid":"511529205213000","cmc":"庆庄村"},{"cid":"511529205214000","cmc":"小坝村"}],"zid":"511529205000000","zmc":"太平乡"},{"list2":[{"cid":"511529208001000","cmc":"场镇居委会"},{"cid":"511529208201000","cmc":"大埝村"},{"cid":"511529208202000","cmc":"钢丝村"},{"cid":"511529208203000","cmc":"顺天村"},{"cid":"511529208204000","cmc":"西河村"},{"cid":"511529208205000","cmc":"新桥村"},{"cid":"511529208206000","cmc":"建设村"},{"cid":"511529208207000","cmc":"红椿村"},{"cid":"511529208208000","cmc":"石笋村"},{"cid":"511529208209000","cmc":"瓦窑村"},{"cid":"511529208210000","cmc":"烂坝村"},{"cid":"511529208211000","cmc":"南坪村"},{"cid":"511529208212000","cmc":"红岩村"},{"cid":"511529208213000","cmc":"红光村"}],"zid":"511529208000000","zmc":"夏溪乡"},{"list2":[{"cid":"511529210201000","cmc":"屏边村"},{"cid":"511529210202000","cmc":"山河村"},{"cid":"511529210203000","cmc":"塘湾村"},{"cid":"511529210204000","cmc":"林场村"},{"cid":"511529210205000","cmc":"青龙村"},{"cid":"511529210206000","cmc":"麻柳村"},{"cid":"511529210207000","cmc":"街基村"}],"zid":"511529210000000","zmc":"屏边彝族乡"},{"list2":[{"cid":"511529211201000","cmc":"星星村"},{"cid":"511529211202000","cmc":"英雄村"},{"cid":"511529211203000","cmc":"烂田村"},{"cid":"511529211204000","cmc":"民族村"},{"cid":"511529211205000","cmc":"冒水村"},{"cid":"511529211206000","cmc":"大石村"},{"cid":"511529211207000","cmc":"岩坪村"},{"cid":"511529211208000","cmc":"龙宝村"},{"cid":"511529211209000","cmc":"前山村"},{"cid":"511529211210000","cmc":"后山村"}],"zid":"511529211000000","zmc":"清平彝族乡"},{"list2":[{"cid":"511529212001000","cmc":"新发社区"},{"cid":"511529212201000","cmc":"蒋坝村"},{"cid":"511529212202000","cmc":"石盘村"},{"cid":"511529212203000","cmc":"丁发村"},{"cid":"511529212204000","cmc":"新农村"},{"cid":"511529212205000","cmc":"大桥村"},{"cid":"511529212206000","cmc":"洪坪村"},{"cid":"511529212207000","cmc":"金象村"},{"cid":"511529212208000","cmc":"柑坳村"},{"cid":"511529212209000","cmc":"寺坪村"},{"cid":"511529212210000","cmc":"王场村"},{"cid":"511529212211000","cmc":"庄子村"},{"cid":"511529212212000","cmc":"凉坝村"},{"cid":"511529212213000","cmc":"永康村"}],"zid":"511529212000000","zmc":"新发乡"}]}
     * msg : 操作成功！
     */

    private String check;
    private String code;
    private DataBean data;
    private String msg;

    public String getCheck() {
        return check;
    }

    public void setCheck(String check) {
        this.check = check;
    }

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public static class DataBean {
        private List<ListBean> list;

        public List<ListBean> getList() {
            return list;
        }

        public void setList(List<ListBean> list) {
            this.list = list;
        }

        public static class ListBean {
            /**
             * list2 : [{"cid":"511529100001000","cmc":"东城社区"},{"cid":"511529100002000","cmc":"南城社区"},{"cid":"511529100003000","cmc":"西城社区"},{"cid":"511529100004000","cmc":"北城社区"},{"cid":"511529100201000","cmc":"共和村"},{"cid":"511529100202000","cmc":"金鱼村"},{"cid":"511529100203000","cmc":"平和村"},{"cid":"511529100204000","cmc":"永跃村"},{"cid":"511529100205000","cmc":"芋和村"},{"cid":"511529100206000","cmc":"集翠村"},{"cid":"511529100207000","cmc":"锦屏村"},{"cid":"511529100208000","cmc":"万涡村"},{"cid":"511529100209000","cmc":"桃坪村"},{"cid":"511529100210000","cmc":"附城村"},{"cid":"511529100211000","cmc":"回龙村"},{"cid":"511529100212000","cmc":"青年村"},{"cid":"511529100213000","cmc":"盐井村"},{"cid":"511529100214000","cmc":"五一村"},{"cid":"511529100215000","cmc":"六一五村"},{"cid":"511529100216000","cmc":"新村"},{"cid":"511529100217000","cmc":"光辉村"},{"cid":"511529100218000","cmc":"天仙村"},{"cid":"511529100219000","cmc":"四坪村"},{"cid":"511529100220000","cmc":"中和村"},{"cid":"511529100221000","cmc":"柏坪村"},{"cid":"511529100222000","cmc":"栗子村"},{"cid":"511529100223000","cmc":"金沙村"}]
             * zid : 511529100000000
             * zmc : 锦屏镇
             */

            private String zid;
            private String zmc;
            private List<List2Bean> list2;

            public ListBean(String zid, String zmc, List<List2Bean> list2) {
                this.zid = zid;
                this.zmc = zmc;
                this.list2 = list2;
            }

            public String getZid() {
                return zid;
            }

            public void setZid(String zid) {
                this.zid = zid;
            }

            public String getZmc() {
                return zmc;
            }

            public void setZmc(String zmc) {
                this.zmc = zmc;
            }

            public List<List2Bean> getList2() {
                return list2;
            }

            public void setList2(List<List2Bean> list2) {
                this.list2 = list2;
            }

            public static class List2Bean {
                /**
                 * cid : 511529100001000
                 * cmc : 东城社区
                 */

                private String cid;
                private String cmc;

                public String getCid() {
                    return cid;
                }

                public void setCid(String cid) {
                    this.cid = cid;
                }

                public String getCmc() {
                    return cmc;
                }

                public void setCmc(String cmc) {
                    this.cmc = cmc;
                }
            }
        }
    }
}
